# Домашнее задание 2 

Необходимо реализовать схему, указанную в hw_diagram.pdf

## Описание таблиц 
PeopleStatus - Описание возможных статусов людей, которые есть в университете (Студент, Преподаватель).
Faculties - Описание факультетов, которые есть в университете (KIB, IT, и т.д.).
People - Информация о людях в университете (Имя, почта, ссылка на факультет, ссылка на статус).
Classes - Описание возможных классов в университете (название (Математический анализ) и ссылка на факультет).
Semesters - Справочник семестров факультета(например, Осень2016, '2016-01-01', '2016-12-31').
ClassesSchedule - Расписание классов (ссылки на семестр, преподавателя и курс, день недели, время начала).
StudentsSchedule - Таблица, описывающая, какой студент ходит на какой курс.

In [11]:
%load_ext sql
%sql sqlite:///chinook1.db

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

'Connected: @chinook1.db'

## Создание таблиц
Напишет ниже скрипты по созданию таблиц с учетом всех внешних ключей.

In [15]:
%%sql
PRAGMA foreign_keys = ON

   sqlite:///chinook.db
 * sqlite:///chinook1.db
Done.

[]

In [23]:
%%sql
DROP TABLE if exists StudentsSchedule;
DROP TABLE if exists ClassesShedule;
DROP TABLE if exists People;
DROP TABLE if exists Classes;
DROP TABLE if exists Semesters;

DROP TABLE if exists PeopleStatus;


DROP TABLE if exists Faculties;
CREATE TABLE PeopleStatus (ID integer(0,0) NOT NULL Primary key, name varchar(0,0)); 

CREATE TABLE People (ID integer(0,0) NOT NULL Primary key,
                    name varchar(0,0) NOT NULL,
                    email varchar(0,0),
                    fac_id integer(0,0) NOT NULL,
                    status_id integer(0,0) NOT NULL,
                    FOREIGN KEY (status_id) REFERENCES PeopleStatus(ID),
                    FOREIGN KEY (fac_id) REFERENCES Faculties(ID));

CREATE TABLE ClassesShedule (ID integer(0,0) NOT NULL Primary key, 
                            class_id integer(0,0) NOT NULL,
                            teacher_id integer(0,0) NOT NULL,
                            semester_id integer(0,0) NOT NULL,
                            week_day integer(0,0),
                            time_start varchar(0,0),
                            FOREIGN KEY (semester_id) REFERENCES Semesters(ID),
                            FOREIGN KEY (class_id) REFERENCES Classes(ID),
                            FOREIGN KEY (teacher_id) REFERENCES People(ID));

CREATE TABLE Faculties (ID integer(0,0) NOT NULL Primary key,
                        name varchar(0,0) NOT NULL);

CREATE TABLE StudentsSchedule (student_id integer(0,0) NOT NULL,
                               ClassesSchedule_id integer(0,0) NOT NULL, 
                               FOREIGN KEY (student_id) REFERENCES People (ID),
                               FOREIGN KEY (ClassesSchedule_id) REFERENCES ClassesShedule (ID));

CREATE TABLE Semesters (ID integer(0,0) NOT NULL Primary key, 
                        shortname varchar(0,0), 
                        date_start date(0,0), 
                        date_end date(0,0)); 

CREATE TABLE Classes (ID integer(0,0) NOT NULL Primary key, 
                      description varchar(0,0),
                      fuc_id integer(0,0) NOT NULL,
                      FOREIGN KEY (fuc_id) REFERENCES Faculties(ID));

   sqlite:///chinook.db
 * sqlite:///chinook1.db
Done.
Done.
0 rows affected.
Done.
Done.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

## Добавление записей в таблицы
Приведите примеры добавления записей в каждую из таблиц

In [17]:
%%sql 
INSERT INTO PeopleStatus (ID,name) VALUES (1,'student');
INSERT INTO PeopleStatus (ID,name) VALUES (2,'teacher');
select * 
from PeopleStatus
order by id

   sqlite:///chinook.db
 * sqlite:///chinook1.db
1 rows affected.
1 rows affected.
Done.

[(1, 'student'), (2, 'teacher')]

In [18]:
%%sql 
INSERT INTO Faculties (ID, name) VALUES (1,'Cyber');
INSERT INTO Faculties (ID, name) VALUES (2,'FTI');
INSERT INTO Faculties VALUES (3,'Fizteh');
INSERT INTO Faculties VALUES (4,'Economy');

select *
from Faculties

   sqlite:///chinook.db
 * sqlite:///chinook1.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
Done.

[(1, 'Cyber'), (2, 'FTI'), (3, 'Fizteh'), (4, 'Economy')]

In [19]:
%%sql 
INSERT INTO People VALUES (1,'Abzalov Azamat', 'kirashuffler@gmail.com', 1, 1);
INSERT INTO People VALUES (2, 'Petrov Vlad', 'vladpro@mail.ru', 1, 2);
INSERT INTO People VALUES (3, 'Ivashkov Vlad', 'dreamveawer3x@mail.ru', 2, 1);

select * 
from People
order by id

   sqlite:///chinook.db
 * sqlite:///chinook1.db
1 rows affected.
1 rows affected.
1 rows affected.
Done.

[(1, 'Abzalov Azamat', 'kirashuffler@gmail.com', 1, 1),
 (2, 'Petrov Vlad', 'vladpro@mail.ru', 1, 2),
 (3, 'Ivashkov Vlad', 'dreamveawer3x@mail.ru', 2, 1)]